{
  "basics": {
    "name": "Marianna Yamenko",
    "label": "Salesforce Lead",
    "email": "<EMAIL>",
    "phone": "<PHONE>",
    "summary": "Salesforce Lead with 8+ years of expertise in project leadership and end-to-end ownership of Salesforce platforms. Proficient in Sales Cloud, Service Cloud, Marketing Cloud, Marketing Cloud Account Engagement (Pardot), Nonprofit Success Pack (NPSP). Strong project management and mentoring skills.",
    "location": {
      "city": "Sydney",
      "region": "Australia"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "marianna-yamenko-976017102",
        "url": "https://www.linkedin.com/in/marianna-yamenko-976017102"
      },
      {
        "network": "Trailblazer",
        "url": "https://trailblazer.me/id/mgoncharova"
      }
    ]
  },
  "work": [
    {
      "company": "InfoTrack",
      "position": "Salesforce & Pardot Engineer",
      "website": "https://www.infotrack.com.au",
      "startDate": "Jul 2021",
      "highlights": [
        "Salesforce and Marketing Cloud Account Engagement (Pardot) platform owner with a base of 170+ users across Australia, New Zealand, and the UK.",
        "Led a project involving C-level stakeholders to achieve net revenue growth in the low spending client segment, which resulted in 53% net revenue increase.",
        "Increased security compliance from 67% to 94% in the Salesforce org by implementing robust session settings and multi-factor authentication, which resulted in a significant reduction in security risks and enhanced protection against data breaches.",
        "Built and deployed a complex lead qualification and routing system that reduced the overall lead qualification and assignment time by 300%.",
        "Implemented an internal Salesforce knowledge base, reducing user requests by 19%.",
        "Initiated and sent out a bi-monthly company-wide Salesforce newsletter, enhancing user adoption and productivity.",
        "Introduced Scrum practices and DACI (Driver, Approver, Contributor, Informed) framework to the team to improve agility and delivery efficiency, resulting in faster project delivery, increased collaboration, and enhanced adaptability to changing requirements.",
        "Lead internal \"Women in Tech\" community, mentor, share knowledge, help partners and fellow colleagues."
      ]
    },
    {
      "company": "Assistance Dogs Australia",
      "position": "Salesforce Administrator",
      "website": "https://www.assistancedogs.org.au",
      "startDate": "May 2019",
      "endDate": "Jun 2021",
      "highlights": [
        "Led the migration from a legacy CRM to Salesforce, which resulted in a seamless transition, zero data discrepancies, and improvement in data accessibility.",
        "Established and implemented a robust security model in compliance with security standards and best practices, which significantly enhanced data protection, reducing security risks by 38%.",
        "Led integration of Salesforce with Marketing Cloud, resulting in significant improvement in marketing automation processes.",
        "Planned, built, and executed event-driven journeys across donor touchpoints, increasing lead conversion by 9%.",
        "Played a pivotal role in adopting the Scrum framework within the team, leading to improved project management, collaboration, and adaptability."
      ]
    },
    {
      "company": "Philip Morris International",
      "position": "Salesforce Administrator",
      "website": "https://www.pmi.com",
      "startDate": "Sep 2018",
      "endDate": "Mar 2019",
      "highlights": [
        "Led the development of a complex lead distribution model for more than 200 cities across the country, which optimised lead management processes and increased lead conversion rates by 18%.",
        "Redesigned the task creation process for the call centre, resulting in reducing task creation time from 4 hours to 1 minute.",
        "Developed and continuously maintained 20+ flows to ensure the call centre's smooth and trouble-free operation, resulting in a 15% reduction in average handling time.",
        "Provided technical support for 500+ users across the country, ensuring seamless Salesforce operation and user satisfaction.",
        "Leveraged Pardot Engagement Studio to create automated programs for sales and marketing, contributing to an 11% increase in customer retention."
      ]
    },
    {
      "company": "Bodytreats Australia",
      "position": "Marketing and Sales Administrator",
      "website": "https://www.facebook.com/BodyTreatsBeauty",
      "startDate": "Apr 2016",
      "endDate": "Aug 2018",
      "highlights": [
        "Increased the median email campaign open rate from 10.9% to 24.5% and click-through rate from 3.7% to 4.6%.",
        "Successfully increased organic traffic for the website by 39% within 6 months."
      ]
    },
    {
      "company": "Harvest Power Group",
      "position": "Salesforce Administrator (contract)",
      "website": "https://www.linkedin.com/company/harvest-power-group",
      "startDate": "May 2016",
      "endDate": "Oct 2016",
      "highlights": [
        "Managed establishing of a new Salesforce org, meeting 100% of stakeholder requirements within the targeted timeline.",
        "Reduced data import time by 49% through optimised processes and improved duplicate management, resulting in a 22% decrease in data discrepancies.",
        "Conducted Salesforce training programs across the organisation, achieving a 98% satisfaction rate among participants and ensuring a 25% increase in user proficiency."
      ]
    },
    {
      "company": "Study Network Australia",
      "position": "Salesforce Administrator (contract)",
      "website": "https://www.linkedin.com/company/study-network-australia",
      "startDate": "Feb 2016",
      "endDate": "Apr 2016",
      "highlights": [
        "Planned and executed email campaigns, resulting in a 23% growth of the prospective student database and a 13% increase in retention rate.",
        "Streamlined data reporting processes, achieving a 40% reduction in reconciliation time on a weekly basis.",
        "Enhanced overall system performance by improving data accuracy by 15%, contributing to more effective decision-making and system reliability."
      ]
    }
  ],
  "education": [
    {
      "institution": "Khabarovsk State Academy of Economics and Law",
      "area": "Advertising",
      "studyType": "Bachelor’s degree with Distinction",
      "startDate": "Sep 2005",
      "endDate": "May 2010"
    }
  ],
  "skills": [
    {
      "name": "Salesforce Products",
      "keywords": [
        "Sales Cloud",
        "Service Cloud",
        "Marketing Cloud",
        "Marketing Cloud Account Engagement (Pardot)",
        "Nonprofit Success Pack (NPSP)"
      ]
    },
    {
      "name": "Salesforce Development",
      "keywords": [
        "Apex Triggers",
        "Apex Classes",
        "Flows",
        "Salesforce Object Query Language (SOQL)"
      ]
    },
    {
      "name": "Project Management",
      "keywords": [
        "Agile/Scrum Framework",
        "DACI (Driver, Approver, Contributor, Informed) Framework",
        "Jira",
        "Asana",
        "Trello"
      ]
    }
  ],
  "awards": [
    {
      "title": "Salesforce Certified Administrator",
      "date": "May 2018"
    },
    {
      "title": "Salesforce Certified Marketing Cloud Email Specialist",
      "date": "Oct 2020"
    },
    {
      "title": "Certified Scrum Master",
      "date": "Oct 2020"
    }
  ]
}
